[
  {"id":"DOWNLOAD_AS_PDF", "en": "Download as pdf", "fr": "télécharger pdf"},
  {"id":"EDUCATION_TITLE", "en": "Education", "fr": "Education"},
  {"id":"MFA_TITLE", "en": "Master in Fine Arts", "fr": "Master en beaux-arts"},
  {"id":"MFA_DESC", "en": "Major in environmental art. Graduated without outstanding results.", "fr": "Majeure en \"Environmental Art\". Diplômé avec les félicitations du jury."},
  {"id":"HKI_FI", "en": "Helsinki, Finland", "fr": "Helsinki, Finlande"},
  {"id":"MA_TITLE", "en": "Master in Political Science", "fr": "Master en science politique"},
  {"id":"MA_DESC", "en": "Major in public administration. Master thesis written for member of European Parliament Satu Hassi on lobbying practices in EU politics.", "fr": "Majeure en administration. Thèse écrite pour le compte de Satu Hassi, député européenne."},
  {"id":"ME_TITLE", "en": "Master in Economics", "fr": "Master en économie"},
  {"id":"ME_DESC", "en": "Major in micro-economics. Master thesis on the Finnish innovation system.", "fr": "Majeure en microéconomie. Thèse sur le système finlandais d'innovation."},
  {"id": "BENEFITS_1", "en":"Experience and education is good and well. Still, I think that a good developer benefits from a wide breadth of knowledge, one extending beyond purely technical skills. A developer does not work in an isolated bubble and should be able to translate technical aspects into language understandable to non-technical stakeholders, and vice-versa. Similarly, front end development involves not only writing good code but also be aware of its visual output and understanding the context in which the app is to be used. I believe this is what might set me apart from many. My background might be unusual but this is what makes me flexible, able to efficiently communicate with various stakeholders, learn fast and, at the end of the day, be a better programmer.", "fr": "L'experience et les études sont une choses mais cela ne suffit pas forcément à distinguer un bon dévelopeur. De fait, un dévelopeur avec de plus larges compétences, au-delà des aspects purement techniques du métier, en bénéficie sans aucun doute. Un dévelopeur ne travaille pas isolé du reste du monde et doit être capable de traduire des concepts techniques de façon à être compris de toutes les parties prenantes au projet auquel il contribue. De la même façon, le coeur du métier ne consiste pas seulement à produire du code mais aussi comprendre le contexte dans lequel l'application est utilisée et à être sensible aux aspects visuels. Je crois que c'est exactement à ce niveau que je peux me distinguer de beaucoup. Mes expériences passées peuvent paraître hors du commun mais c'est justement cela qui me permet d'être flexible, de pouvoir communiquer facilement avec toutes sortes d'acteurs, d'apprendre rapidement et au final, de devenir un meilleur programmeur."},
  {"id":"BENEFITS_2", "en":"Now you reached the bottom of the page. Congratulations! If you are not overwhelmed with skepticism and believe I could benefit your team, please reach out. This might be a match!", "fr":"Vous avez enfin atteint le bas de la pages. Félicitations! Si vous n'êtes pas enhavis d'une vague de scepticisme et que vous pensez que je pourrais apporter une plus value à votre équipe, contactez moi. Cela pourrait être une heureuse rencontre!"},
  {"id":"EXP_TITLE", "en":"Experience", "fr":"Experience"},
  {"id":"EXP_1", "en":"Web developer and then Senior web developer", "fr":"Web developer puis Senior web developer"},
  {"id":"EXP_1_DESC", "en":"In charge of the whole frontend development in AngularJS. Migrated codebase from ES5 to ES6 and build processes from Grunt to Webpack. Integrated Redux. Heavily optimized performance (bundling, lazy loading, reduce dependency exposure).", "fr":"En charge de tout le développement \"front end\" avec AngularJS. Migration de ES5 vers ES6 et de Grunt vers Webpack. Intégration de Redux. Forte optimisation de la performance(bundling, chargement à la demande, reduction de l'exposition aux dépendences)."},
  {"id":"EXP_2", "en":"Freelance web developer", "fr":"Freelance web developer"},
  {"id":"EXP_2_DESC_1","en":"Freelance projects mostly based on Wordpress. In the ","fr":"Projets en sous-traitance, principalement basés sur Wordpress. Dans le"},
  {"id":"EXP_2_DESC_2","en":"last project","fr":"dernier projet"},
  {"id":"EXP_2_DESC_3","en":"I built an Angular frontend and served content via Wordpress REST api.","fr":"j'ai créé un \"frontend\" avec AngularJS assurant la gestion de contenu via Wordpress REST api."},
  {"id":"EXP_3","en":"Independent visual artist and doctoral candidate in Fine Arts","fr":"Artiste indépendant et doctorant en beaux-arts"},
  {"id":"EXP_4", "en":"Master student in Fine Arts", "fr":"Etudiant en Master Beaux-arts"},
  {"id":"EXP_4", "en":"Master student in Fine Arts", "fr":"Etudiant en Master Beaux-arts"},
  {"id":"EXP_5", "en":"Economic advisor to the French ambassador in Finland","fr":"Conseiller économique près l'ambassadeur de France en Finlande"},
  {"id":"EXP_6","en":"2 master degrees, postman, seasonal worker in agriculture, and a bunch of other things","fr":"2 Masters, postier, saisonnier dans l'agriculture et quelques autres fonctions"},
  {"id":"SKILLS_TITLE", "en":"Skills","fr":"Compétences"},
  {"id":"SKILL_DESC", "en":"Skills bar charts are probably meaningless. What about hearts instead to show what technologies I like to work with? Let's still list things in (subjective) order of proficiency. =)","fr":"Les diagrammes de compétences ne sont pas très révélateurs. Pourquoi ne pas plutôt utiliser des coeurs pour distinguer les technologies avec lesquelles je préfère travailler? Celles-ci sont tout de même listées en ordre (subjectif) de maîtrise."},
  {"id":"SKILL_NG", "en":"By bread and butter for the last 2 years. It's certainly suffering performance issues in comparison with Angular2 but it remains a good framework, especially with the improvements brought with 1.5 and 1.6 (components, life cycle hooks).", "fr":"Au centre de ma vie depuis 2 ans. La performance pêche sans doute un peu la comparaison avec Angular2 mais cela reste un bon produit, particulièrement avec les améliorations apportées par les versions 1.5 et 1.6 (components, life cycle hooks)."},
  {"id":"SKILL_SASS", "en":"Define your variables and mixins, import and ensure design consistency. I love SASS!",  "fr":"Définissez vos variables et mixins, importez et assurez vous ainsi de la cohérence du design. J'adore SASS!"},
  {"id":"SKILL_ES6", "en":"It was a relief when I could finally use ES6 at work. It saves time, is easier to read and practically outdated Lodash. We still need to compile but let's be bold and dream that, one day there are gonna be only evergreen browsers out there and we'll not need the whole polyfill shebang.", "fr":"Quel soulagement quand j'ai finalement pu commencer à utiliser ES6 professionellement: économie de temps, facilité de lecture et la possibilité de se débarasser de Lodash. Nous devons toujours compiler mais soyons optimistes, un jours tous les navigateurs seront \"evergreen\" et nous n'aurons plus besoin de charger de polyfills."},
  {"id":"SKILL_JQ", "en":"Jquery is OK. This page is even using it heavily! But more often than not, it's required in projects which could totally do without (I work with AngularJS right).", "fr":"Jquery peut être utlie. Cette page en fait même un large usage! Malheureusement, c'est souvent requis dans des projets qui pourraient totalement s'en passer(oui je travaille surtout avec AngularJs)"},
  {"id":"SKILL_WEBPACK","en":"Steep learning curve at first. But what a time saver! Setup in a matter of minutes, not hours. No need anymore to write 100s of lines of Gulp tasks or rely on ill-suited Yeoman generators. Just spin Webpack with minimal config and you are good to go!","fr":"La courbe d'apprentissage est un peu raide au début mais quel gain de temps ensuite! Cela nous permet de commencer un projet en quelques minutes et non en quelques heures. Plus besoin d'écrire des centaines de lignes de tâches Gulp ou de se baser sur un générateur Yeoman mal adapté. Un simple configuration Webpack suffit souvent."},
  {"id":"SKILL_GULP","en":"I am still using it but now that we got Webpack is it really necessary? I admit it's more flexible but for very specific tasks, one might as well just write plain Node scripts.","fr":"Maintenant que nous avons Webpack, en avons nous vraiment besoin? C'est certainement une solution plus flexible mais pour les tâches vraiment spécifiques, on peut tout aussi bien utiliser Node."},
  {"id":"SKILL_NG2","en":"I used it only in hobby projects. It might have too much boilerplate for some. Coming from AngularJS, I still enjoy the improvements on the latter a lot. And the use of the CLI largely offsets the boilerplate problem IMHO.", "fr":"Je ne m'en suis servi que dans des projets personnels jusqu'alors. Certain reprochent la trop grande quantité de \"boilerplate\". Étant un utilisateur d'AngularJS, j'apprécie tout de même les améliorations."},
  {"id":"SKILL_TS","en":"\"Property x of y is not defined\". How many times a JS developer gets bitten by type errors? The solution? Interfaces! Maybe Typescript feels like too much overhead at first but boy does it save time in the long run.","fr":"\"Property x of y is not defined\". Combien de fois ce type d'erreur peut être rapporté dans un projet typique?  La solution? Utiliser des interfaces! Au premier abord, Typescript peut sembler ralentir le développement mais sur le long terme, les bénéfices sont réels."},
  {"id":"SKILL_NODE","en":"I'm not too familiar with Node. But when needing specialized build task, or spinning a proxy with authentication, routing etc, that's my choice.","fr":"Je ne suis pas entièrement familier avec Node. Mais lorsque je dois écrire une tâche de compilation relativement spécialisée, ou produire un petit proxy, c'est mon premier choix."},
  {"id":"SKILL_FW","en":"Frameworks are good. Only are they not good for everything. When I see the entire Bootstrap loaded to style a form of 3 inputs, I cry.","fr":"Les frameworks sont utiles. Mais ils ne sont pas la panacée. Quand je vois tout Bootstrap importé pour styler un formulaire de 3 inputs, j'ai envie de pleurer."},
  {"id":"SKILL_JASMINE","en":"Testing is a must. I haven't tried other testing frameworks as Jasmine has always been serving its purpose. Maybe I should?","fr":"Les tests sont indispensables. Je n'ai pas essayé d'autre solution, compte tenu que Jasmine a toujours satisfait mes besoins. Peut-être devrais-je?"},
  {"id":"SKILL_REDUX","en":"I love Redux! In a complex app with lots of data types and backend sync operations, it really improves maintainability by enforcing unique data management strategies.","fr":"J'adore Redux! Dans les app un peu complexes, son usage améliore vraiment la gestion des données en instaurant une stratégie unique et efficace."},
  {"id":"BENEFITS", "en": "Benefits", "fr":"Bénéfices"},
  {"id":"FR", "en":"French", "fr":"Français"},
  {"id":"EN", "en":"English", "fr":"Anglais"}
]